#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_secgroup_v2.ssh: Refreshing state... [id=f4091969-aab8-4e55-a56e-316aba5adfa0]
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=e3bee0fc-62ca-41de-aa3d-832015eafa3f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.13.124" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "brno1" -> (known after apply)
      ~ flavor_name         = "standard.medium" -> (known after apply)
      ~ id                  = "e3bee0fc-62ca-41de-aa3d-832015eafa3f" -> (known after apply)
      ~ image_name          = "ubuntu-bionic-x86_64" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "3f21f110901a7373751beff2fbd74b1c705797dc" -> "1245e250f260798c65178af757b4c9c7e7597aaa" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.13.124" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:b2:14:70" -> (known after apply)
          ~ name           = "demofedcloud" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*